Repository: zabbix-jp/translation
Catalog: releasenote/releasenote-omegat.tmx
Source language: en_us
Languages: ja

source: [ZBX-3403] removed UNIQUE constraint for autoreg_host_1 index
ja: [ZBX-3403] インデックスautoreg_host_1のユニーク制約を削除

source: Added monitoring of Proxy availability
ja: プロキシの死活監視機能を追加

source: fixed communication between systems with different byte orders
ja: バイトオーダーが異なるシステム間のコミュニケーションを修正

source: Added support of macros {HOSTNAME},{HOST.CONN},{IPADDRESS},{HOST.DNS} for item keys.
ja: アイテムのキーに{HOSTNAME}、{HOST.CONN}、{IPADDRESS}、{HOST.DNS}のマクロ機能を追加

source: [ZBX-3970] fixed proxy crash after database connection to postgresql is recovered
ja: [ZBX-3970] PostgreSQLへのデータベースコネクションの回復後にプロキシが異常終了してしまう問題を修正

source: [ZBX-2683] minor updates for the Latvian translation
ja: [ZBX-2683] ラトビア語の翻訳を更新

source: Other databases will be supported as well.
ja: 他のデータベースについても、同様にサポートする予定です。

source: [ZBX-1547] fixed SQL error while executing discovery action 'remove host'
ja: [ZBX-1547] ディスカバリーのホスト削除のアクション実行時のSQLエラーを修正

source: [ZBX-954] fixed typos in changelog, error messages and frontend item hints
ja: [ZBX-954] changelog、エラーメッセージ、フロントエンドのアイテムのヒント内の誤記を修正

source: [ZBX-910] Queue/Details screen now displays only 500 records
ja: [ZBX-910] キュー/詳細の画面を500件のみ表示するように修正

source: [ZBX-1385] proxy list in host configuration form is now sorted
ja: [ZBX-1385] ホスト設定画面のプロキシのリストをソートするように修正

source: Normal and extended host profiles merged.
ja: 標準および拡張のホストプロファイルを統合しました。

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.3rc1 (Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.3rc1 (Release Candidate)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-3063] added compatibility with PostgreSQL 9+; thanks to Andrey Groshev for patch
ja: [ZBX-3063] PostgreSQL 9以降の互換性を追加; Andrey Groshevのパッチ提供に感謝

source: [ZBX-2745] improved performance of screen element "History of events"
ja: [ZBX-2745] スクリーンの要素"イベント履歴"のパフォーマンスを改善

source: [ZBX-2114] improvements in SQL filtering of hosts and templates by nodes
ja: [ZBX-2114] ノードによるホストとテンプレートをフィルタするSQLを改善

source: [ZBX-1435] fixed exporting triggers with '&'
ja: [ZBX-1435] 「&」を利用したトリガーのエクスポートを修正

source: Other Improvements and Bug Fixes
ja: その他の改善とバグフィックス

source: Added support of time shifted functions
ja: タイムシフトの機能を追加

source: The old user permission schema is no longer supported.
ja: 以前のユーザパーミッションスキーマはすでにサポートされません。

source: [ZBX-2711] added links to host profile in dashboard "last 20 issues" host menu
ja: [ZBX-2711] ホストプロファイルにダッシュボードのホストメニュー"最新20件の障害"へのリンクを追加

source: The server-side external checks can be used to introduce custom checks executed on ZABBIX server side.
ja: サーバサイト拡張チェックは、ZABBIXサーバ側でカスタムチェックを実行することが可能です。

source: [DEV-238] added support of sec|#num for function count()
ja: [DEV-238] count()関数にsecと#numの設定を追加

source: Changed linked Template color in application page.
ja: アプリケーションページ内のテンプレートのリンクされたテンプレートの色を変更。

source: [ZBX-1369] make more strings translatable
ja: [ZBX-1369] より多くの文字を翻訳できるように改善

source: [ZBX-1529] fixed macros expand to nothing in templates
ja: [ZBX-1529] マクロがテンプレートに展開されない問題を修正

source: [ZBX-2152] fixed names of SNMPv3 security levels
ja: [ZBX-2152] SNMPv3のセキュリティレベルの名前を修正

source: New option to show items without data
ja: データなしのアイテムを表示するオプション

source: [ZBX-884] added subject field for Jabber notifications
ja: [ZBX-884] Jabber通知に件名フィールドを追加

source: Now Zabbix correctly processes unavailability of the database engine.
ja: Zabbixはデータベースエンジンが利用できなくなったことを正しく処理できるようになりました。

source: [ZBX-30,ZBX-47] better dependencies
ja: [ZBX-30,ZBX-47] 依存関係の改善

source: For line drawing was used axis from first item not trigger item
ja: トリガーの設定されているアイテムではなく、最初のアイテムの軸が利用されていました

source: added synchronisation of last value and timestamps for distributed monitoring
ja: 分散モニタリングに最終値とタイムスタンプの同期機能を追加

source: [ZBX-1029] added lookup of Jabber SRV records to Jabber notifications; thanks to Edward Rudd
ja: [ZBX-1029] Jabber通知にJabber SRVレコードの参照を追加; Edward Ruddに感謝

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.6.
ja: ZABBIX SIAはZABBIX 1.6のリリースをアナウンスすることを光栄に思います。

source: [ZBX-915] fixed pgsql cycling on transaction failure
ja: [ZBX-915] pgsqlのトランザクション失敗が繰り返される問題を修正

source: [ZBX-4375] updated Russian translation; thanks to Alexey Pustovalov
ja: [ZBX-4375] ロシア語翻訳を更新; Alexey Pustovalovに感謝

source: [ZBX-1362] optimized alert performance
ja: [ZBX-1362] アラートのパフォーマンスを最適化

source: [ZBX-4221] fixed sorting by host in Configuration->Web
ja: [ZBX-4221] 設定->ウェブ画面のホストによるソートを修正

source: [ZBX-865] fixed displaying templates without groups in template linkage page
ja: [ZBX-865] テンプレートリンクのページのグループに所属しないテンプレートの表示を修正

source: Might be useful for embedded environments and low profile hardware.
ja: 組み込み環境や低スペックのハードウェアに役に立つかもしれません。

source: [ZBX-3333] fixed icmppingloss[] returning bad values when NIC bonding is used
ja: [ZBX-3333] NICのボンディングを利用時にicmppingloss[]が不正な値を返す問題を修正

source: [ZBX-3840] fixed possible path disclosure
ja: [ZBX-3840] サーバ内のパスが表示される問題を修正

source: [DEV-356] moved dropdown configuration from defines to frontend
ja: [DEV-356] ドロップダウンの設定を定義ファイルからフロントエンドに移動

source: added new default user group "Disabled"
ja: デフォルトのユーザグループ「Disabled」の追加

source: What's New in 1.8.7
ja: 1.8.7の変更点

source: What's New in 1.8.6
ja: 1.8.6の変更点

source: This document contains the release notes for Zabbix 1.8.10.
ja: このドキュメントはZabbix 1.8.10のリリースノートを含みます。

source: [ZBX-213] added sql patches for graphs_items color field
ja: [ZBX-213] graphs_itemsのcolorフィールドのためのいくつかのSQLパッチを追加

source: Much Better Performance
ja: パフォーマンスの改善

source: [DEV-355] changed node management interface
ja: [DEV-355] ノード管理インターフェースの変更

source: What's New in 1.8.8
ja: 1.8.8の変更点

source: [ZBX-172] fixed incorrect SQL caused by character ' in item key
ja: [ZBX-172] アイテムのキーに文字列「'」が含まれている場合に、間違ったSQLが実行される問題を修正

source: What's New in 1.8.1
ja: 1.8.1の変更点

source: [ZBX-1230] IP address is made a default selection in host details form
ja: [ZBX-1230] ホストの詳細設定フォームでIPアドレスをデフォルト設定に利用するように修正

source: What's New in 1.8.3
ja: 1.8.3の変更点

source: What's New in 1.8.2
ja: ZABBIX 1.8.2の変更点

source: What's New in 1.8.5
ja: 1.8.5の変更点

source: [ZBX-1758] improved node filtering in sqls
ja: [ZBX-1758] SQL文のノードのフィルタリングを改善

source: What's New in 1.8.4
ja: 1.8.4の変更点

source: [ZBX-1222] fixed default Debug Log level for agents
ja: [ZBX-1222] エージェントのデフォルトのデバッグログレベルの問題(訳注: ログレベルのハードコーディング、不正なファイル名)を修正

source: [ZBX-808] renamed service.ntp parameter of net.tcp.service{.perf} to ntp
ja: [ZBX-808] net.tcp.service{.perf}のservice.ntpパラメータ名をntpに変更

source: [ZBX-2556] added dropdown length limit in frontend
ja: [ZBX-2556] Webインターフェースのドロップダウンに長さの制限を追加

source: [ZBX-1483] fixed icmppingsec to return seconds as in 1.6.x
ja: [ZBX-1483] icmppingsecが1.6.xのように秒を返すように修正

source: [ZBX-1944] fixed no permission error when trying to view simple graph from childnodes
ja: [ZBX-1944] 子ノードからシンプルグラフを表示しようとすると、パーミッションが付与されていないため実行できない（no permission）エラーになる問題を修正

source: Default action conditions
ja: デフォルトのアクション条件

source: fixed import of triggers with {HOSTNAME} macro
ja: {HOSTNAME}マクロを使用しているトリガーのインポートを修正

source: Linux agent supports iowait,interrupt,softirq and steal for system.cpu.util.
ja: Linuxのアイテムsystem.cpu.utilにiowait、interrupt、softirq、stealオプションを追加

source: [ZBX-1575] added UnsafeUserParameters configuration option for agents
ja: [ZBX-1575] エージェントの設定オプションにUnsafeUserParametersを追加

source: [ZBX-1714] added confirmation dialogue for proxy operations
ja: [ZBX-1714] Proxyの操作に確認ダイアログを追加

source: [ZBX-3257] fixed item type auto selection in item key popup
ja: [ZBX-3257] アイテムのキーのポップアップ内のアイテム種別の自動選択を修正

source: Support of themes for ZABBIX front-end
ja: ZABBIXフロントエンドのテーマ機能

source: added extension to hosts when importing graph to template
ja: グラフのインポート形式にホスト名を追加

source: [ZBX-1763] added last week to SLA weekly graph
ja: [ZBX-1763] SLAの週間グラフに前の週の表示を追加

source: [DEV-253] improved audit log filtering
ja: [DEV-253] 監査ログのフィルタリングを改善

source: More flexible node configuration
ja: より柔軟なノード設定

source: [ZBXNEXT-792] added type parameter for system.hostname on Windows to support both NetBIOS and host names
ja: [ZBXNEXT-792] Windows上でNetBIOS名とホスト名の両方に対応できるようsystem.hostnameにtypeパラメータを追加

source: fixed definition of serial columns to allow use of older MySQL
ja: より古いMySQLを利用できるようにするためにserialカラムの定義を修正

source: What's not ready yet but expected in 1.5
ja: ZABBIX 1.5でまだ有効になっていない機能

source: [ZBX-954] fix Hungarian language name
ja: [ZBX-954] ハンガリー語の誤字を修正

source: [ZBX-2981] removed unnecessary queries in map permission checks
ja: [ZBX-2981] マップの権限チェックの不要なクエリを削除

source: [ZBX-250] speed improvement for Triggers when use "{ITEM.VALUE}" macro
ja: [ZBX-250] トリガーに{ITEM.VALUE}マクロを利用した場合の速度を改善

source: [ZBX-1850] fixed warnings when saving host with enabled profile
ja: [ZBX-1850] プロファイルを有効にした場合にホストの保存時に出力されるワーニングを修正

source: [ZBX-3023] fixed repeated notifications after maintenance period
ja: [ZBX-3023] メンテナンス期間後に通知レポートが繰り返される問題を修正

source: added timeout handler for http monitoring
ja: HTTP監視にタイムアウトハンドラを追加

source: fixed unefficient SQL in browsing of events
ja: イベント参照の非効率なSQLを修正

source: [ZBX-3065] fixed undefined variables in maps.php when logged as guest and no maps defined
ja: [ZBX-3065] ゲストとしてアクセスしマップが定義されていない時にmaps.php内でundefined variablesエラーが発生していた問題を修正

source: [ZBX-857] changed queue details timestamp to timestamp defined in locale file
ja: [ZBX-857] キューの詳細タイムスタンプをロケール内で定義されているものに変更

source: [ZBX-542] added processing of nextcheck for active checks
ja: [ZBX-542] アクティブチェックに次回チェックの処理を追加

source: Queue moved into Administration
ja: キューを管理に移動

source: [ZBX-3074] moved the 'Status' column in the item list to the right
ja: [ZBX-3074] アイテムリストの 'ステータス' カラムを右に移動

source: [ZBX-2959] fixed trailing whitespace & missing trailing newline in downloaded translations
ja: [ZBX-2959] 翻訳ファイルをダウンロードした際に末尾の空白文字や改行文字が消えてしまう問題を修正

source: Zabbix will compain if there are unsupported attributes in server, proxy or agent configuration files.
ja: サーバ、プロキシまたはエージェントの設定ファイル内にサポートされていない属性があった場合に通知します。

source: List of Bugs and Improvements included into 1.8.4rc4
ja: 1.8.4rc4に含まれるバグフィックスと改善の一覧

source: It is safe to use Zabbix with the latest releases of PostgreSQL.
ja: Zabbixと一緒にPostgreSQLの最新リリースを安全に利用できます。

source: List of Bugs and Improvements included into 1.8.4rc3
ja: 1.8.4rc3に含まれるバグフィックスと改善の一覧

source: [ZBX-848] fixed typos in changelog and comments
ja: [ZBX-848] 変更履歴とコメントの表記間違いを修正

source: No upgrade of database schema required for upgrade from 1.4, 1.4.1 or 1.4.2.
ja: 1.4、1.4.1、1.4.2からアップグレードする場合、データベーススキーマのアップグレードは必要ありません。

source: List of Bugs and Improvements included into 1.8.4rc2
ja: 1.8.4rc2に含まれるバグフィックスと改善の一覧

source: List of Bugs and Improvements included into 1.8.4rc1
ja: 1.8.4rc1に含まれるバグフィックスと改善の一覧

source: This is the first release in a series of pre-1.4 releases.
ja: このリリースはpre-1.4の最初のリリースであり、

source: ZABBIX supports the use of different trigger expressions to go into ON and OFF states.
ja: ONとOFFの状態変化のために異なるトリガー条件式を使用することができます。

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.5.3, fourth release in a series of pre-1.6 betas.
ja: ZABBIX SIAは1.6のベータ版の4番目のリリースとなるZABBIX 1.5.3のリリースをアナウンスすることを光栄に思います。

source: fixed "Reset" button for Web screens
ja: Web画面のリセットボタンを修正

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.4rc2 (Second Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.4rc2 (2番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: This document contains the release notes for ZABBIX version 1.1beta12.
ja: このドキュメントはZABBIX1.1beta12のリリースノートです。

source: [ZBX-894] fixed processing of {ITEM.LASTVALUE} for alerts if the trigger expression consists of several items
ja: [ZBX-894] トリガー条件式にいくつかのアイテムを使用した場合のアラートの{ITEM.LASTVALUE}の処理を修正

source: changed priorities of '|' and '&' in trigger expressions
ja: トリガー条件式の「|」と「&」の優先度を変更

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.4rc1 (First Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.4rc1 (1番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-1477] fixed moving screen elements with spans
ja: [ZBX-1477] 列や行が結合されているスクリーン要素を移動する際に起こる問題を修正

source: Escalations and Repeated Notifications
ja: エスカレーションと繰り返し通知

source: MySQL only.
ja: これはMySQLのみ利用できます。

source: What's New in 1.5 (beta)
ja: ZABBIX 1.5 (beta)の変更点

source: [ZBX-2360] added multiple acknowledging for OK>UNKNOWN>OK and PROBLEM>UNKNOWN>PROBLEM events
ja: [ZBX-2360] 正常>不明>正常と障害>不明>障害イベントに対する障害対応コメントの一括処理を追加

source: [ZBX-962] removed "Found: 0" from media type config form
ja: [ZBX-962] メディアタイプの設定フォームから「Found: 0」を削除

source: [ZBX-2997] added global regular expression to be sent to proxies (for use with log,logrt and eventlog items)
ja: [ZBX-2997] プロキシに送信するグローバルな正規表現を追加(log、logrt、eventlogアイテムに利用するため)

source: [ZBX-2469] fixed screen API
ja: [ZBX-2469] スクリーンに関するAPIを修正

source: [DEV-391] Notifications: added new {DISCOVERY.*} macros
ja: [DEV-391] 通知用の新しいマクロ{DISCOVERY.*}を追加

source: [ZBX-631] fixed incorrect incoming string values if using dbcache
ja: [ZBX-631] dbcacheを利用している場合に間違った文字列データを受信する問題を修正

source: Advanced WEB monitoring
ja: Web監視の改善

source: [ZBX-2752] improved text coloring
ja: [ZBX-2752] テキストのカラー表示を改善

source: [ZBX-1101] fixed hostid error when editing host
ja: [ZBX-1101] ホスト編集時のホストIDのエラーを修正

source: Improved auto-discovery
ja: オートディスカバリの改善

source: improved performance of server module
ja: サーバモジュールのパフォーマンスを改善

source: [ZBX-3821] removed warning messages about failed evaluation of trigger expressions
ja: [ZBX-3821] トリガー式の評価失敗に関する警告メッセージを削除

source: Zabbix Team is proud to announce the availability of Zabbix 1.8.10rc2 (Second Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.10rc2 (2番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-2729] improved host-group and host filter selection
ja: [ZBX-2729] ホストグループとホストのフィルター選択を改善

source: added non-persistent connection for PostgreSQL to avoid problems with unfinished transactions
ja: 終了しないトランザクションの問題を回避するためにPostgreSQL用の一時的なコネクションを追加

source: [ZBX-2525] improved actions API code
ja: [ZBX-2525] アクションに関するAPIコードを改善

source: Added support of negative numbers.
ja: マイナスの数値を利用することができます。

source: Native support of Jabber messaging has been introduced.
ja: Jabberメッセージングのネイティブサポート

source: We also provide trouble-free upgrade service for easy migration from earlier versions to Zabbix 1.8.x.
ja: また、私たちはトラブルフリーで簡単にZabbix 1.8以前のバージョンから移行するためのアップグレードサービスも提供しています。

source: Access to template is much easier now, it is a separate menu item.
ja: テンプレートを個別のメニューに分離し、アクセスを容易にしました。

source: It is highly recommended to upgrade!
ja: アップグレードすることを強く推奨します。

source: [ZBX-1325] fixed error when add host or hostgroup with PostgreSQL
ja: [ZBX-1325] PostgreSQL使用時にホストまたはホストグループ追加時のエラーを修正

source: Database cache module
ja: データベースキャッシュモジュール

source: [ZBX-3973] added logging of proxy mode (active/passive) at startup
ja: [ZBX-3973] 起動時にプロキシのモード(アクティブ/パッシプ)のログ出力を追加

source: fixed displaying "no status update" error for template triggers
ja: テンプレートのトリガーで「no status update」が表示される問題を修正

source: [ZBX-1725] fixed graph item sortorder
ja: [ZBX-1725] グラフのアイテムのソート順を修正

source: This document contains the release notes for Zabbix 1.7.
ja: このドキュメントはZABBIX 1.7のリリースノートを含みます。

source: A map element may have multiple links (URLs) to external resources.
ja: マップの要素に複数の外部URLリンクを設定することができます。

source: [ZBX-874] fixed evaluation of items nextcheck for flexible intervals
ja: [ZBX-874] 例外の更新間隔のアイテムの次回のチェックの評価方法を修正

source: JSON-RPC based API
ja: JSON-RPCベースのAPI

source: [ZBX-2482] fixes in chart graphs avg calc
ja: [ZBX-2482] 折線グラフの平均値の計算処理の問題を修正

source: [ZBX-1397] make 'History' string in page header translatable, thanks to Alexey Pustovalov
ja: [ZBX-1397] ページヘッダの「History」文字を翻訳できるように修正。Alexey Pustovalovに感謝

source: [ZBX-1150] added refreshing of not supported performance counters
ja: [ZBX-1150] サポートされていないパフォーマンスカウンタの更新処理を追加

source: [ZBXNEXT-335] links starting with http(s) are now clickable in hosts inventory
ja: [ZBXNEXT-335] ホストのインベントリで、http(s)で始まるリンクをクリックできるように改善

source: [ZBX-272] fixed default link to local interface in *BSD for net.if* items
ja: [ZBX-272] BSD系のnet.if*アイテムのデフォルトのローカルインターフェース名を修正

source: [ZBX-2786] fixed errors in trigger dependency mass update popup
ja: [ZBX-2786] 一括更新ポップアップ画面のトリガーの依存関係のエラーを修正

source: A new syntax can be used to monitor SNMP data with a dynamic index.
ja: 新しい構文で動的インデックスを持ったSNMPを監視することができます。

source: Host profiles were renamed to a more standard "host inventory".
ja: ホストプロファイルはより一般的な「ホストインベントリ」に名称変更されました。

source: The release fixes several critical and many other issues.
ja: このリリースはいくつかの問題の修正を行っています。

source: [ZBX-1467] fixed graph copying
ja: [ZBX-1467] グラフのコピーを修正

source: Groups of server side processes (discoverer, poller, HTTP poller, trapper, etc) can be located on different physical servers for better performance and availability.
ja: より良いパフォーマンスと可用性のために、サーバ上のプロセスのグループ(discover、poller、HTTP poller、trapperなど)を物理的に異なるサーバ上で稼働させることができます。

source: [ZBX-3902] fixed possible zombie states in UNIX, moved watchdog (server) and heartbeats (proxy) to separate processes (main process just waits), added more logging to exiting Windows agent
ja: [ZBX-3902] UNIX環境でゾンビプロセスが発生する可能性を修正、サーバの状態監視やプロキシのハートビートのプロセスを別プロセスに分離、Windowsエージェントの終了時のログの追加

source: [ZBX-650] fixed cleanup of open file descriptor
ja: [ZBX-650] ファイルオープンディスクリプタのクリーンアップ処理を修正

source: [ZBX-2105] fixed acknowledging events from dashboard for different nodes
ja: [ZBX-2105] 異なるノードからのイベントに対してダッシュボードから障害対応コメントを入力した場合の問題を修正

source: [ZBX-2385] added macro {TRIGGER.PROBLEM.EVENTS.PROBLEM.UNACK}
ja: [ZBX-2385] {TRIGGER.PROBLEM.EVENTS.PROBLEM.UNACK}マクロを追加

source: [ZBX-295] fixed processing of null values under Oracle
ja: [ZBX-295] Oracle利用時のnull値の処理を修正

source: [ZBX-134] fixes for hostid/groupid validation on Node switch
ja: [ZBX-134] ノード切替のhostid/grupidのバリデーションを修正

source: [ZBXNEXT-343] added possibility to unlink and clear templates when mass update hosts templates
ja: [ZBXNEXT-343] ホストテンプレートを一括更新する際、テンプレートのリンクを外したりクリアできる機能を追加

source: [ZBX-853] fixed item massdelete if not zabbix item selected
ja: [ZBX-853] zabbixではないアイテムを選択した場合のアイテムの一括更新の処理を修正

source: [DEV-350] cleanup of sample config files, added sample of windows agent config
ja: [DEV-350] サンプル設定ファイルの見直しとWindowsエージェントのサンプル設定ファイルの追加

source: Added autodiscovery by ICMP pings
ja: ICMP Pingによるオートディスカバリを追加

source: [DEV-137] added file CREDITS
ja: [DEV-137] CREDITSファイルを追加

source: [ZBXNEXT-238] added a command line option to zabbix_sender to send metrics in real time when reading from stdin
ja: [ZBXNEXT-238] 標準入力から読み込む際、リアルタイムでメトリックを送信するコマンドラインオプションをzabbix_senderに追加

source: [ZBX-1346] update example agent daemon configuration file for Windows with parameters from Zabbix manual
ja: [ZBX-1346] Windowsエージェントのサンプル設定ファイルをZabbixマニュアルのパラメータに基づいて更新

source: Macros for referencing all profile fields introduced.
ja: 全てのプロファイルのフィールドを参照するためのマクロを追加しました。

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.3rc4 (Fourth Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.3rc4 (4番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-1532] added screen name to visual screen editing form (when adding screen rows and cols)
ja: [ZBX-1532] スクリーンの編集画面(スクリーンの行や列を追加する画面)にスクリーン名を追加

source: [ZBX-2492] fixed japanese translation, all sprintf and their placeholders have been removed from phrases from all languages
ja: [ZBX-2492] 日本語訳を修正し、すべてのsprintf関数とそれらのプレースホルダーを全言語のフレーズから削除

source: [ZBX-2395] fixed sending of the same message to the same user using different media types
ja: [ZBX-2395] 異なるメディアタイプを使用して同じメッセージを同じユーザに送信できるように修正

source: [ZBX-479] fixed compilation of Zabbix agent under Mac OS/X
ja: [ZBX-479] Mac OS/XのZabbixエージェントのコンパイルを修正

source: The bar graphs can be used for long-term trend analysis.
ja: バーグラフは長期間のトレンドを解析するために利用することができます。

source: [ZBX-3229] improved output of configure script
ja: [ZBX-3229] configureスクリプトの出力を改善

source: [ZBX-1882] fixed selecting items from disabled hosts for graphs
ja: [ZBX-1882] グラフ設定で無効になっているホストからアイテムを選択する場合の問題を修正

source: [ZBX-24] fixed Queue to show status of current node only
ja: [ZBX-24] 現在のノードの状態のみ表示するようにキューの画面を修正

source: The new widget displays number of hosts having problems per each host group.
ja: 新しいウィジットはホストグループごとの障害の数を表示します

source: Added performance monitoring of LVM devices.
ja: LVMデバイスのパフォーマンス監視を追加しました。

source: [ZBX-250] fixed 100% CPU on server side after unexpected connection loss
ja: [ZBX-250] 予期しないコネクションロスが発生した場合に、サーバのCPUが100%になる問題を修正

source: [ZBX-898] fixed slow performance of events component on a screen
ja: [ZBX-898] スクリーンのイベント構成要素のパフォーマンスの遅さを修正

source: [ZBX-3555] fixed possible pollers hang while processing ssh.run[] checks
ja: [ZBX-3555] ssh.run[]チェック処理中にpollerがハングアップしてしまう問題を修正<

source: [ZBX-2988] fixed {ITEM.VALUE} macro in Monitoring/Events screen
ja: [ZBX-2988] 監視データ/イベント画面のマクロ{ITEM.VALUE}の問題を修正

source: improved msg functionality in GUI
ja: GUIのメッセージ機能改善

source: [ZBX-315] fixed irregulary stop of server on OpenBSD
ja: [ZBX-315] OpenBSD上でサーバが不規則に停止する問題を修正

source: Improved view of trigger statuses
ja: トリガー状態の表示を改善

source: [ZBX-2978] fixed graphs import with Y axis set to an item
ja: [ZBX-2978] Y軸が設定されたアイテムを含むグラフのインポート処理を修正

source: [ZBX-1871] made Zabbix not require mbstring_overload to be enabled
ja: [ZBX-1871] Zabbixがmbstring_overload機能を有効にする要求を出さないように設定

source: [ZBX-395] fixed item list for simple graph
ja: [ZBX-395] シンプルグラフのアイテムリストを修正

source: Zabbix SIA is proud to announce the availability of Zabbix 1.9.7 (Second Beta Release of Zabbix 2.0).
ja: Zabbix SIAはZabbix 1.9.7 (Zabbix 2.0の2番目のベータリリース)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-2283] fixed incorrect time calculating in slidebar
ja: [ZBX-2283] スライドバーにおける間違った時間の計算を修正

source: [ZBX-2023] improved trigger configuration page
ja: [ZBX-2023] トリガー設定画面を改善

source: fixed incorrect processing of net.tcp.listen
ja: net.tcp.listenの誤った処理を修正

source: [DEV-358] added notification macros {ITEM.VALUE} and {ITEM.VALUE[1..9]}
ja: [DEV-358] 通知用マクロ{ITEM.VALUE}と{ITEM.VALUE[1..9]}を追加

source: [ZBX-2562] improved sessions store
ja: [ZBX-2562] セッションの保存を改善

source: [ZBX-2460] fixed auto adding host group to updated host
ja: [ZBX-2460] 更新されたホストにホストグループが自動で追加される問題を修正

source: fixed processing of SNMP octet strings
ja: SNMPのオクテット値の処理を修正

source: fixed problem with Enabling/Disabling actions
ja: 有効/無効の動作の問題を修正

source: [ZBX-3562] fixed user macros in map element label expressions
ja: [ZBX-3562] マップ要素のラベルの式内のユーザマクロを修正

source: This release fixes numerous issues of Zabbix 1.8 and introduces new interesting features.
ja: このリリースにはZabbix 1.8のいくつかの修正と新機能の紹介が含まれます。

source: [ZBX-1031] fixed security vulnerability in server, allowing remote unauthenticated users to execute arbitrary SQL queries.
ja: [ZBX-1031] リモートの認証されていないユーザが任意のSQLクエリを実行できてしまうサーバの脆弱性を修正。

source: [ZBX-1800] updated Japanese translation; thanks to Kodai
ja: [ZBX-1800] 日本語訳の更新; Kodaiに感謝

source: [DEV-460] improved host-group and maps icons info in Zabbix maps
ja: [DEV-460] Zabbixマップでホストグループとマップアイコンの情報を改善

source: [ZBX-2957] changed mime type for downloadable locale file
ja: [ZBX-2957] ダウンロード可能な言語ファイルのMIMEタイプを変更

source: [DEV-453] implemented import/export of Zabbix maps
ja: [DEV-453] Zabbixのマップのインポート/エクスポート機能を実装

source: [ZBX-1312] removed huge, unused Japanese fonts
ja: [ZBX-1312] 使用していないサイズの大きい日本語フォントを削除

source: [ZBX-2672] added internal checks zabbix[*] to help items in data.sql
ja: [ZBX-2672] インターナルチェックzabbix[*]のアイテムのヘルプをdata.sqlに追加

source: [ZBX-554] added proxy host info in export/import
ja: [ZBX-554] エクスポート/インポートにプロキシホストの情報を追加

source: [ZBX-610] fixed memory leak in external checks
ja: [ZBX-610] 外部チェックのメモリリークを修正

source: [ZBX-2179] fixed errors connected with Triggers Info screen element
ja: [ZBX-2179] トリガー情報画面の接続エラーを修正

source: [ZBX-2301] fixed "configure" script with libssh2-1.0.0 library
ja: [ZBX-2301] libssh2-1.0.0ライブラリを利用する場合の「configure」スクリプトの問題を修正

source: List of Bug Fixes and Improvements included into 1.8.6rc2
ja: 1.8.6rc2に含まれるバグフィックスと改善の一覧

source: [ZBX-2798] added more checks for unknown nodes to communication between nodes
ja: [ZBX-2798] ノード間の通信により多くの不明なノードのチェック処理を追加
